import Image from 'next/image'
import React from 'react'

function Introduction({status}) {
    return (
        <div className={` ${status === "Introduction" ? "flex flex-col" : "hidden"}  gap-6`}>
            <div className='flex'>
                <div className=''>
                <h3 className='lg:text-2xl md:text-xl text-lg font-medium'>
                بن مانو
                </h3>
                <p className='md:text-lg text-base text-justify mt-4'>بن مانو یکی از شرکت‌های معتبر در زمینه تولید قهوه درجه یک است که در این زمینه موفقیت‌های زیادی کسب کرده است. محصولات بن مانو، بسیار متنوع و متناسب با هر سلیقه‌ای تولید می‌شود. بسته‌بندی‌های 250 گرمی پودرهای قهوه برای مصارف خانگی بسیار مناسب است چرا که با توجه به وزن بسته‌بندی در مدت زمان کوتاهی مصرف می‌شوند و بدین ترتیب عطر و تازگی قهوه کماکان حفظ می‌شود.</p>
                </div>
            </div>
            <div className='flex md:flex-row flex-col justify-between gap-10'>
                <div className='md:w-3/4'>
                <h3 className='lg:text-2xl md:text-xl text-lg font-medium'>
                قهوه انرژی زا طبیعی
                </h3>
                <p className='md:text-lg text-base text-justify mt-4'>قهوه یکی از نوشیدنی‌هایی است که طرفدارهای زیادی دارد. این نوشیدنی بسیار خوش طعم است و به دلیل کافئین بالا، اگر در وعده صبحانه آن را مصرف نمایید بدن شما در طول روز انرژی لازم برای انجام فعالیت‌های گوناگون را دارد. به عبارت ساده، پس از نوشیدن قهوه، کافئین جذب جریان خون شده، و پس از عبور از ایست بازرسی مغز، به سیستم اعصاب مرکزی ورود پیدا می‌کند. کافئین پس از ورود به سیستم اعصاب مرکزی، به سراغ آدنوزین (عامل احساس خستگی و خواب‌آلودگی) می‌رود و از فعالیت آن جلوگیری می‌کند قهوه خاصیت‌های زیادی دارد یکی از خواص مهم قهوه داشتن آنتی‌اکسیدان است دانه قهوه به صورت ذاتی دارای آنتی‌اکسیدان است. این ترکیبات قهوه بدن ما رو در برابر بیماری‌ها محافظت می‌کند و قهوه منبع سرشار از آنتی‌اکسیدان است. این نوشیدنی با توجه به آرامش‌بخش بودن باعث شده تا در بین همه محبوبیت ویژه‌تری داشته باشد. به طور معمول برای سرو قهوه از فنجان کوچک استفاده می‌کنیم. به دلیل رایج شدن قهوه ابزار و دستگاه‌های زیادی برای تهیه این نوشیدنی دوست داشتنی ساخته شده است که می‌توان آن را با کیفیت‌های متفاوتی تولید کرد. وجود تلخی در این نوشیدنی باعث شده تا آن دلچسب‌تر باشد. البته برخی افراد ترجیح می‌دهند آن را شیرین تر میل کنند. برای کمتر شدن تلخی آن می‌توانیم آن را در کنار کمی شکر یا شیر سرو کنیم.</p>
                </div>
                <div className='md:w-1/4'>
                    <Image src="/images/products/coffee.jpg" className='w-full h-full' width={150} height={400} alt='coffee' />
                </div>
            </div>
        </div>
    )
}

export default Introduction
